request.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0" xmlns:ns2="http://www.ups.com/XMLSchema/XOLTWS/Rate/v1.1" xmlns:ns3="http://www.ups.com/XMLSchema/XOLTWS/UPSS/v1.0"><SOAP-ENV:Header><ns3:UPSSecurity><ns3:UsernameToken><ns3:Username>CalibreIntl</ns3:Username><ns3:Password>Sonic888!</ns3:Password></ns3:UsernameToken><ns3:ServiceAccessToken><ns3:AccessLicenseNumber>BCDE048692BBDB75</ns3:AccessLicenseNumber></ns3:ServiceAccessToken></ns3:UPSSecurity></SOAP-ENV:Header><SOAP-ENV:Body><ns2:RateRequest><ns1:Request><ns1:RequestOption>Shop</ns1:RequestOption></ns1:Request><ns2:PickupType><ns2:Code>01</ns2:Code><ns2:Description>Daily Pickup</ns2:Description></ns2:PickupType><ns2:CustomerClassification><ns2:Code>01</ns2:Code><ns2:Description>Classfication</ns2:Description></ns2:CustomerClassification><ns2:Shipment><ns2:Shipper><ns2:Name></ns2:Name><ns2:ShipperNumber></ns2:ShipperNumber><ns2:Address><ns2:AddressLine></ns2:AddressLine><ns2:City></ns2:City><ns2:StateProvinceCode></ns2:StateProvinceCode><ns2:PostalCode>21093</ns2:PostalCode><ns2:CountryCode>US</ns2:CountryCode></ns2:Address></ns2:Shipper><ns2:ShipTo><ns2:Name></ns2:Name><ns2:Address><ns2:AddressLine></ns2:AddressLine><ns2:City></ns2:City><ns2:StateProvinceCode></ns2:StateProvinceCode><ns2:PostalCode>92656</ns2:PostalCode><ns2:CountryCode>US</ns2:CountryCode><ns2:ResidentialAddressIndicator></ns2:ResidentialAddressIndicator></ns2:Address></ns2:ShipTo><ns2:ShipFrom><ns2:Name></ns2:Name><ns2:Address><ns2:AddressLine></ns2:AddressLine><ns2:City></ns2:City><ns2:StateProvinceCode></ns2:StateProvinceCode><ns2:PostalCode>21093</ns2:PostalCode><ns2:CountryCode>US</ns2:CountryCode></ns2:Address></ns2:ShipFrom><ns2:Service><ns2:Code>03</ns2:Code><ns2:Description>Service Code</ns2:Description></ns2:Service><ns2:Package><ns2:PackagingType><ns2:Code>02</ns2:Code><ns2:Description>Rate</ns2:Description></ns2:PackagingType><ns2:Dimensions><ns2:UnitOfMeasurement><ns2:Code>IN</ns2:Code><ns2:Description>inches</ns2:Description></ns2:UnitOfMeasurement><ns2:Length>5</ns2:Length><ns2:Width>4</ns2:Width><ns2:Height>10</ns2:Height></ns2:Dimensions><ns2:PackageWeight><ns2:UnitOfMeasurement><ns2:Code>LBS</ns2:Code><ns2:Description>Pounds</ns2:Description></ns2:UnitOfMeasurement><ns2:Weight>1</ns2:Weight></ns2:PackageWeight></ns2:Package><ns2:ShipmentServiceOptions/></ns2:Shipment></ns2:RateRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>